let a;
let b;
let c;
let x =6;
let y = 2;
let z;

// Խնդիր 1: Տրված է X իրական թիվը: Պահանջվում է A
// փոփոխականին վերագրել X–ի արժեքի ամբողջ մասը, իսկ B
// փոփոխականինª X–ի արժեքի կոտորակային մասը:

// x = 17.6
// let A = Math.floor(x)
// console.log("amboxj masy =" + A);
// var B =



// 2.Դուք, հավանաբար, ծանոթ եք y = |x| ֆունկ–
// ցիային: Այո, դա x փոփոխականի բացարձակ արժեքի
// հաշվման ֆունկցիան է, որը որոշվում է հետևյալ ձևով.

//  x = -56;


// if (x>=0) {
//    y = 'x'
// }else{
//     y = '-x'
// }

// console.log(y);



// 3.Առաջարկվող ֆունկցիան որոշված է իրական
// թվերի ողջ բազմության վրա, սակայն տարբեր հատվածներում հաշվարկվում է տարբեր արտահայտություններով.


//  x=6;
// 

// if (x>=0 && x<5) {
//    y=(2*x*x)+(3*x)-1
// }else{
//     y=x+1
// }

// console.log(y);

// 4.փոփոխականի կամայական արժեքների
// համար, ելնելով առկա պայմաններից, առաջարկվում է
// հաշվել հետևյալ ֆունկցիայի արժեքը.



// if (Math.abs(x)<=5) {
//     console.log('y=f2');
// } else if (x>12 && x <=20) {
//     console.log('y=f1');

// }else(
//     console.log('y=f3');
// }

// 5.Տրված են եռանկյան կողմերի x, y, z երկա–
// րությունները: Պետք է պարզելª տվյալ եռանկյունին սուր–
// անկյու±ն է, թեª ոչ: 




// if ((x*x)<(y*y)+(z*z) && (y*y)<(x*x)+(z*z) && (z*z)<(x*x)+(y*y)) {
//     console.log('surankyun e');
    
// }else{
//     console.log('surankyun che');
// }
// -----------------------------------------------------------------
// 35 ej


// 1.


// if (x>-10 && x<=-6) {
//     y= x+1
// }else if(Math.abs(x)<=3){
// y= x*x
// }else{
//     y = x
// }

// console.log(y);

// 2.

// if ((a+b)>10) {
//     y = (a*x)+b
// }else if((a+b)>=-15 && (a+b)<2){
//     y = (b*x)-a
// }else{
//     y = a+b
// }

// console.log(y);

// 3.

// if (Math.abs(x)<=4) {
//     y = x+(3*a)
// }else if(x>5 && x<=8){
// y = (a*x)-2
// }else if(Math.abs(x)>20){
//     y = x*x
// }else{
//     y = 3*x
// }

// 4.



// 5.

// if (x<y) {
//     a = (x*y)/2
//     x = (x+y)/2

// }else{
//     a = (x*y)/2
//     x = (x+y)/2
// }
// y=a
// console.log(x);
// console.log(y);


